language/C++.org
#+SETUPFILE: ~/.emacs.d/themes/org-html-themes/setup/theme-readtheorg.setup
#+OPTIONS: \n:t
#+OPTIONS: ^:nil
#+OPTIONS: tex:t
#+STARTUP: latexpreview
#+OPTIONS: tex:dvipng
#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler
#+attr_html: :width 300px
#+attr_latex: :width 300px
#+ATTR_ORG: :width 300

#+TITLE: C++ - 特性太多太复杂的语言

*上选java下选c，中不取c++*

* 基础学习
** 快速入门

访问程序返回值
- linux: echo $?
- win  : echo %ERRORLEVEL%

标准输入/输出
| istream -> cin  | 标准输入         |
| ostream -> cout | 标准输出         |
| ostream -> cerr | 标准错误         |
| ostream -> clog | 程序执行一般信息 |

cout, cin等输入、输出流对象返回值(调用方法)为输入、输出流本身，所以可以 cout << .... << .... <<

endl - 换行，默认 *同时刷新缓冲区*

定义一个类 == 定义了一种类型，类型名与类名相同

类方法 - 成员函数 - 由类定义的函火女禾禾

同一类型的所有对象共享同一个定义方法

** 基本语言

语言特性:允许自定义数据类型、提供库，妈实用函数和数据类型

单个unsigned == unsigned int

字面值常量有默认类型: 0 - int, 3.1415 - double

转义字符 \000 -> 八进制  \xddd -> 十六进制

两个相邻的字符串可连接，如 std::cout << "Hello World" "I'm" << endl;

#+begin_src c++
using namespace std;
#include <iostream>

int main(int argc, char *argv[])
{
    int val1(1024);             // 直接初始化
    int val2 = 1024;            // 复制初始化

    cout << val1 << "  " << val2 << endl;
    return 0;
}
#+end_src

构造函数 - 如何进行初始化的成员函数, *在gcc中，构造函数会在对象实例化后被调用*
对象定义后立即可见，可用同一定义中前面已定义变量的值初始化后面的变量

最大公约数 - 辗转相除法

#+begin_src c++
extern double pi = 3.14;       // 仍被当作定义，只有extern用作函数外部，才可以有初始化式
#+end_src

*C语言对于单个文件，为什么函数可不用声明直接调用， 不在此文件中的变量不可直接使用?*
*对函数，C风格有统一的ABI，C可根据入参直接生成汇编代码，而变量不知类型，不知占用空间大小，所以使用前需声明，对于C++，因为重载特性，入参类型会作为函数名的一部分，所以不能直接调用*

const限定符，将对象转化为常量，必须赋初值
全局作用域下的const变量，其作用域在文件内，除非定义时加上extern关键字
const修饰后编译时会直接转化为常量，如：
#+begin_src c++
using namespace std;
#include <iostream>

// 5 15
int main(int argc, char *argv[])
{
    const int x = 5;
    int *y = (int *)&x;

    *y = 15;
    cout << x << "  " << *y << endl; //相当于 cout << 5 << "  " << *y << endl;

    return 0;
}
#+end_src

引用是别名，必须初始化而且同一类型
#+begin_src c++
using namespace std;
#include <iostream>

// 10 10
int main(int argc, char *argv[])
{
    int val = 1024;
    int &val2 = val;

    val = 10;
    cout << val << "  " << val2 << endl;

    return 0;
}
#+end_src

枚举类型的对象的初始化或赋值，只能通过其枚举成员或同一枚举类型的其他对象来进行

*C语言中指明全局变量和static变量的初始化式必须为常量表达式，但是C++可以使用函数初始化，编译器实现为.finit段，在main执行前会执行.finit段中的函数*

头文件 <> - 查找在预定义位置，不找源文件所在路径
头文件 "" - 源文件所在路径, 后找预定义位置

class和struct关键字定义类区别在于默认访问权限
struct -> public
class  -> private

