language/C++.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-29 Thu 19:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ - 特性太多太复杂的语言</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="xuali2" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">C++ - 特性太多太复杂的语言</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc6298a6">1. 基础学习</a>
<ul>
<li><a href="#org62259cc">1.1. 快速入门</a></li>
<li><a href="#org5f15d42">1.2. 基本语言</a></li>
<li><a href="#orgca3a843">1.3. 标准库类型</a></li>
<li><a href="#orge862109">1.4. 数组与指针</a></li>
<li><a href="#org2110e6c">1.5. 表达式</a></li>
<li><a href="#orgf524b85">1.6. 语句</a></li>
<li><a href="#org4bfc20e">1.7. 函数</a></li>
<li><a href="#org04c573f">1.8. 标准I/O库</a></li>
</ul>
</li>
<li><a href="#org5c23429">2. 容器和算法</a>
<ul>
<li><a href="#org7891838">2.1. 顺序容器</a></li>
<li><a href="#org256b510">2.2. 关联容器</a></li>
<li><a href="#org8e9a6f6">2.3. 泛型算法</a></li>
</ul>
</li>
<li><a href="#org18cae47">3. 类和数据抽象</a>
<ul>
<li><a href="#org3f5107b">3.1. 类</a></li>
<li><a href="#orgecfff51">3.2. 复制控制</a></li>
<li><a href="#org77c020a">3.3. 重载操作符与转换</a></li>
<li><a href="#orgf9ac70d">3.4. 面向对象编程</a></li>
<li><a href="#org91f668c">3.5. 模板和泛型编程</a></li>
</ul>
</li>
<li><a href="#orgd6b2d37">4. 高级主题</a></li>
</ul>
</div>
</div>
<p>
<b>上选java下选c，中不取c++</b><br />
</p>

<div id="outline-container-orgc6298a6" class="outline-2">
<h2 id="orgc6298a6"><span class="section-number-2">1</span> 基础学习</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org62259cc" class="outline-3">
<h3 id="org62259cc"><span class="section-number-3">1.1</span> 快速入门</h3>
<div class="outline-text-3" id="text-1-1">
<p>
访问程序返回值<br />
</p>
<ul class="org-ul">
<li>linux: echo $?<br /></li>
<li>win  : echo %ERRORLEVEL%<br /></li>
</ul>

<p>
标准输入/输出<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">istream -&gt; cin</td>
<td class="org-left">标准输入</td>
</tr>

<tr>
<td class="org-left">ostream -&gt; cout</td>
<td class="org-left">标准输出</td>
</tr>

<tr>
<td class="org-left">ostream -&gt; cerr</td>
<td class="org-left">标准错误</td>
</tr>

<tr>
<td class="org-left">ostream -&gt; clog</td>
<td class="org-left">程序执行一般信息</td>
</tr>
</tbody>
</table>

<p>
cout, cin等输入、输出流对象返回值(调用方法)为输入、输出流本身，所以可以 cout &lt;&lt; &#x2026;. &lt;&lt; &#x2026;. &lt;&lt;<br />
</p>

<p>
endl - 换行，默认 <b>同时刷新缓冲区</b><br />
</p>

<p>
定义一个类 == 定义了一种类型，类型名与类名相同<br />
</p>

<p>
类方法 - 成员函数 - 由类定义的函火女禾禾<br />
</p>

<p>
同一类型的所有对象共享同一个定义方法<br />
</p>
</div>
</div>

<div id="outline-container-org5f15d42" class="outline-3">
<h3 id="org5f15d42"><span class="section-number-3">1.2</span> 基本语言</h3>
<div class="outline-text-3" id="text-1-2">
<p>
语言特性:允许自定义数据类型、提供库，妈实用函数和数据类型<br />
</p>

<p>
单个unsigned == unsigned int<br />
</p>

<p>
字面值常量有默认类型: 0 - int, 3.1415 - double<br />
</p>

<p>
转义字符 \000 -&gt; 八进制  -&gt; 十六进制<br />
</p>

<p>
两个相邻的字符串可连接，如 std::cout &lt;&lt; "Hello World" "I'm" &lt;&lt; endl;<br />
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">val1</span>(1024);             <span style="color: #75715E;">// </span><span style="color: #E6DB74;">&#30452;&#25509;&#21021;&#22987;&#21270;</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">val2</span> = 1024;            <span style="color: #75715E;">// </span><span style="color: #E6DB74;">&#22797;&#21046;&#21021;&#22987;&#21270;</span>

    cout &lt;&lt; val1 &lt;&lt; <span style="color: #E6DB74;">"  "</span> &lt;&lt; val2 &lt;&lt; endl;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<p>
构造函数 - 如何进行初始化的成员函数, <b>在gcc中，构造函数会在对象实例化后被调用</b><br />
对象定义后立即可见，可用同一定义中前面已定义变量的值初始化后面的变量<br />
</p>

<p>
最大公约数 - 辗转相除法<br />
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">extern</span> <span style="color: #66D9EF;">double</span> <span style="color: #FD971F;">pi</span> = 3.14;       <span style="color: #75715E;">// </span><span style="color: #E6DB74;">&#20173;&#34987;&#24403;&#20316;&#23450;&#20041;&#65292;&#21482;&#26377;extern&#29992;&#20316;&#20989;&#25968;&#22806;&#37096;&#65292;&#25165;&#21487;&#20197;&#26377;&#21021;&#22987;&#21270;&#24335;</span>
</pre>
</div>

<p>
<b>C语言对于单个文件，为什么函数可不用声明直接调用， 不在此文件中的变量不可直接使用?</b><br />
<b>对函数，C风格有统一的ABI，C可根据入参直接生成汇编代码，而变量不知类型，不知占用空间大小，所以使用前需声明，对于C++，因为重载特性，入参类型会作为函数名的一部分，所以不能直接调用</b><br />
</p>

<p>
const限定符，将对象转化为常量，必须赋初值<br />
全局作用域下的const变量，其作用域在文件内，除非定义时加上extern关键字<br />
const修饰后编译时会直接转化为常量，如：<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>

<span style="color: #75715E;">// </span><span style="color: #E6DB74;">5 15</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #F92672;">const</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">x</span> = 5;
    <span style="color: #66D9EF;">int</span> *<span style="color: #FD971F;">y</span> = (<span style="color: #66D9EF;">int</span> *)&amp;x;

    *y = 15;
    cout &lt;&lt; x &lt;&lt; <span style="color: #E6DB74;">"  "</span> &lt;&lt; *y &lt;&lt; endl; <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#30456;&#24403;&#20110; cout &lt;&lt; 5 &lt;&lt; "  " &lt;&lt; *y &lt;&lt; endl;</span>

    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<p>
引用是别名，必须初始化而且同一类型<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>

<span style="color: #75715E;">// </span><span style="color: #E6DB74;">10 10</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">val</span> = 1024;
    <span style="color: #66D9EF;">int</span> &amp;<span style="color: #FD971F;">val2</span> = val;

    val = 10;
    cout &lt;&lt; val &lt;&lt; <span style="color: #E6DB74;">"  "</span> &lt;&lt; val2 &lt;&lt; endl;

    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<p>
枚举类型的对象的初始化或赋值，只能通过其枚举成员或同一枚举类型的其他对象来进行<br />
</p>

<p>
<b>C语言中指明全局变量和static变量的初始化式必须为常量表达式，但是C++可以使用函数初始化，编译器实现为.finit段，在main执行前会执行.finit段中的函数</b><br />
</p>

<p>
头文件 &lt;&gt; - 查找在预定义位置，不找源文件所在路径<br />
头文件 "" - 源文件所在路径, 后找预定义位置<br />
</p>

<p>
class和struct关键字定义类区别在于默认访问权限<br />
struct -&gt; public<br />
class  -&gt; private<br />
</p>
</div>
</div>
