language/C++.org
** 标准库类型

using namespace::name; - 此后无需再加命令空间前缀

- string
对于字符串长度有限制，不可大于long，重载了 + char 和 char *
#+begin_src c++
using namespace::std;
#include <iostream>

int main(int argc, char *argv[])
{
    string s1;
    string s2(s1);
    string s3("value");
    string s4(5, 'c');

    cout << s1 << endl; // 空
    cout << s2 << endl; // 空
    cout << s3 << endl; // value
    cout << s4 << endl; // ccccc

    cout << s1.empty() << endl; // 1
    cout << s3.size()  << endl; // 5
    cout << s3[0]      << endl; // v
    cout << s3 + s4    << endl; // valueccccc
    cout << (s3 == s4) << endl; // 0
    return 0;
}
#+end_src

::i 代表全局变量，用于局部变量重名覆盖时引用全局变量
#+begin_src c++
using namespace::std;
#include <iostream>

class A
{
public:
    A();
    virtual ~A();

    typedef int size;
};


int main(int argc, char *argv[])
{
    A::size i = 0;

    cout << i << endl;
    return 0;
}
#+end_src
- vector
#+begin_src c++
#include <iostream>
#include <vector>
#include <string>
using namespace::std;

int main(int argc, char *argv[])
{
    vector<string> v1;
    vector<string> v2(v1);
    vector<string> v3(5, "name");
    int i;

    for (i = 0; i < 5; ++i) {
        cout << v3[i] << endl;
    }


    return 0;
}
#+end_src

- iterator
#+begin_src c++
#include <iostream>
#include <vector>
#include <string>
using namespace::std;

int main(int argc, char *argv[])
{
    vector<string>           v3(5, "name");

    for(vector<string>::iterator iter = v3.begin(); iter != v3.end();++iter)
        cout << *iter << "\n";
    return 0;
}
#+end_src

- bitset
值比实际位少时，高阶位为0，string与bitset对象为反向转化，string对象的最右边为bitset低阶位
#+begin_src c++
#include <iostream>
#include <vector>
using namespace::std;

int main(int argc, char *argv[])
{
    bitset<12> b1("01010");

    cout << b1 << "\n";         // 000000001010
    return 0;
}
#+end_src

** 数组与指针
#+begin_src c++
#include <iostream>
using namespace::std;

int main(int argc, char *argv[])
{
    char a[3] = "12";
    char b[3] = "123";          // error: initializer-string for char array is too long
    int  c[3] = "12";           // error: array initializer must be an initializer list

    return 0;
}
#+end_src

- 动态数组
使用new，会将申请内存初始化，如果为类类型，将用默认构造函数初始化
#+begin_src c++
#include <iostream>
using namespace::std;

class A
{
public:
    A() {};
    virtual ~A() {};
};


int main(int argc, char *argv[])
{
    A *x = new A[2];
    A y[2];
    delete []x;
    return 0;
}
#+end_src

