language/C++.html

<div id="outline-container-orgca3a843" class="outline-3">
<h3 id="orgca3a843"><span class="section-number-3">1.3</span> 标准库类型</h3>
<div class="outline-text-3" id="text-1-3">
<p>
using namespace::name; - 此后无需再加命令空间前缀<br />
</p>

<ul class="org-ul">
<li>string<br /></li>
</ul>
<p>
对于字符串长度有限制，不可大于long，重载了 + char 和 char *<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span>::<span style="color: #AE81FF;">std</span>;
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">s1</span>;
    <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">s2</span>(s1);
    <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">s3</span>(<span style="color: #E6DB74;">"value"</span>);
    <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">s4</span>(5, <span style="color: #E6DB74;">'c'</span>);

    cout &lt;&lt; s1 &lt;&lt; endl; <span style="color: #75715E;">// </span><span style="color: #E6DB74;">&#31354;</span>
    cout &lt;&lt; s2 &lt;&lt; endl; <span style="color: #75715E;">// </span><span style="color: #E6DB74;">&#31354;</span>
    cout &lt;&lt; s3 &lt;&lt; endl; <span style="color: #75715E;">// </span><span style="color: #E6DB74;">value</span>
    cout &lt;&lt; s4 &lt;&lt; endl; <span style="color: #75715E;">// </span><span style="color: #E6DB74;">ccccc</span>

    cout &lt;&lt; s1.empty() &lt;&lt; endl; <span style="color: #75715E;">// </span><span style="color: #E6DB74;">1</span>
    cout &lt;&lt; s3.size()  &lt;&lt; endl; <span style="color: #75715E;">// </span><span style="color: #E6DB74;">5</span>
    cout &lt;&lt; s3[0]      &lt;&lt; endl; <span style="color: #75715E;">// </span><span style="color: #E6DB74;">v</span>
    cout &lt;&lt; s3 + s4    &lt;&lt; endl; <span style="color: #75715E;">// </span><span style="color: #E6DB74;">valueccccc</span>
    cout &lt;&lt; (s3 == s4) &lt;&lt; endl; <span style="color: #75715E;">// </span><span style="color: #E6DB74;">0</span>
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<p>
::i 代表全局变量，用于局部变量重名覆盖时引用全局变量<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span>::<span style="color: #AE81FF;">std</span>;
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">A</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #A6E22E; font-size: 130%;">A</span>();
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">A</span>();

    <span style="color: #F92672;">typedef</span> <span style="color: #66D9EF;">int</span> <span style="color: #66D9EF;">size</span>;
};


<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #AE81FF;">A</span>::<span style="color: #66D9EF;">size</span> <span style="color: #FD971F;">i</span> = 0;

    cout &lt;&lt; i &lt;&lt; endl;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>
<ul class="org-ul">
<li>vector<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;vector&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;string&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span>::<span style="color: #AE81FF;">std</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">vector</span>&lt;<span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">v1</span>;
    <span style="color: #66D9EF;">vector</span>&lt;<span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">v2</span>(v1);
    <span style="color: #66D9EF;">vector</span>&lt;<span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">v3</span>(5, <span style="color: #E6DB74;">"name"</span>);
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>;

    <span style="color: #F92672;">for</span> (i = 0; i &lt; 5; ++i) {
        cout &lt;&lt; v3[i] &lt;&lt; endl;
    }


    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<ul class="org-ul">
<li>iterator<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;vector&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;string&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span>::<span style="color: #AE81FF;">std</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">vector</span>&lt;<span style="color: #66D9EF;">string</span>&gt;           <span style="color: #FD971F;">v3</span>(5, <span style="color: #E6DB74;">"name"</span>);

    <span style="color: #F92672;">for</span>(<span style="color: #AE81FF;">vector</span>&lt;<span style="color: #66D9EF;">string</span>&gt;::<span style="color: #66D9EF;">iterator</span> <span style="color: #FD971F;">iter</span> = v3.begin(); iter != v3.end();++iter)
        cout &lt;&lt; *iter &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<ul class="org-ul">
<li>bitset<br /></li>
</ul>
<p>
值比实际位少时，高阶位为0，string与bitset对象为反向转化，string对象的最右边为bitset低阶位<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;vector&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span>::<span style="color: #AE81FF;">std</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">bitset</span>&lt;12&gt; <span style="color: #FD971F;">b1</span>(<span style="color: #E6DB74;">"01010"</span>);

    cout &lt;&lt; b1 &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;         <span style="color: #75715E;">// </span><span style="color: #E6DB74;">000000001010</span>
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge862109" class="outline-3">
<h3 id="orge862109"><span class="section-number-3">1.4</span> 数组与指针</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span>::<span style="color: #AE81FF;">std</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">a</span>[3] = <span style="color: #E6DB74;">"12"</span>;
    <span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">b</span>[3] = <span style="color: #E6DB74;">"123"</span>;          <span style="color: #75715E;">// </span><span style="color: #E6DB74;">error: initializer-string for char array is too long</span>
    <span style="color: #66D9EF;">int</span>  <span style="color: #FD971F;">c</span>[3] = <span style="color: #E6DB74;">"12"</span>;           <span style="color: #75715E;">// </span><span style="color: #E6DB74;">error: array initializer must be an initializer list</span>

    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<ul class="org-ul">
<li>动态数组<br /></li>
</ul>
<p>
使用new，会将申请内存初始化，如果为类类型，将用默认构造函数初始化<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span>::<span style="color: #AE81FF;">std</span>;

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">A</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #A6E22E; font-size: 130%;">A</span>() {};
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">A</span>() {};
};


<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">A</span> *<span style="color: #FD971F;">x</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">A</span>[2];
    <span style="color: #66D9EF;">A</span> <span style="color: #FD971F;">y</span>[2];
    <span style="color: #F92672;">delete</span> []x;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>
</div>
</div>
