language/C++.org
** 表达式

常规的和C相关
强制转换static_cast、dynamic_cast、const_cast、reinterpret_cast
#+begin_src c++
#include <iostream>
using namespace::std;

int main(int argc, char *argv[])
{
    char a = 'a';
    int b = static_cast<char>(a);//正确，将char型数据转换成int型数据

    double *c = new double;
    void *d = static_cast<void*>(c);//正确，将double指针转换成void指针

    int e = 10;
    const int f = static_cast<const int>(e);//正确，将int型数据转换成const int型数据

    const int g = 20;
    int *h = static_cast<int*>(&g);//编译错误，static_cast不能转换掉g的const属性
    return 0;
}
#+end_src

** 语句

只有构造函数可用 函数名():变量(值)的方法初始化变量
#+begin_src c++
#include <iostream>

class A
{
public:
    int i;
    A():i(1) {};
    virtual ~A() {};
};


int main(int argc, char *argv[])
{
    A x;

    std::cout << x.i << std::endl;
    return 0;
}
#+end_src

** 函数
对于引用形参
- 类型要严格匹配
- const不可传入非const
- 右值/具有需要转换的类型的对象

应将不修改相应实参的形参定义为const，因为这可以扩大函数的使用。因为非const引用形参既不能用const对象初始化，也不能用字面值或右值的表达试实参初始化

如果为引用数组，编译器不会将数组实参转化为指针，而是传递数组的引用本身，则数组大小成为形参和实参的一部分，编译器会检查大小，也不可将引用形参当指针给其赋值，而是要真正当作数组

*对于成员函数，如果在类中定义，则符号为weak，并且在本地文件里如果不调用函数则不会生成符号，而如果在类中声明类外定义，则为全局符号，如果文件内没使用也会生成符号*

*通常来说，在头文件(*.h)里声明类定义，在(*.cpp)里定义成员函数的实现*

对于临时对象，析构会在函数退出时调用
#+begin_src c++
#include <iostream>

class A
{
public:
    A() { std::cout << "A ctor" << "\n";};
    virtual ~A() {std::cout << "A dtor" << "\n";};
};

class B
{
public:
    B() { std::cout << "B ctor" << "\n";};
    virtual ~B() {std::cout << "B dtor" << "\n";};
};


//A ctor
//B ctor
//B dtor
//A dtor
int main(int argc, char *argv[])
{
    A x;
    B y;
    return 0;
}
#+end_src

** 标准I/O库

IO对象不可复制或赋值
- 不可存于容器
- 形参/返回类型不能为流类

当输入流与输出流绑在一起时，任何读输入流的尝试都将首先刷新其输出流关联的缓冲区

* 容器和算法
** 顺序容器
| vector | 快速随机访问  |
| list   | 快速插入/删除 |
| deque  | 双端队列      |
在以上三种容器定义新的操作接口
| stack          | 栈         |
| queue          | 队列       |
| priority_queue | 优先级队列 |

初始化
| c<T> c;       | N.A.                              |
| c<T> c(c2);   | N.A.                              |
| c<T> c(b, e); | b, e是迭代器,标示范围内元素的副本 |
| c<T> c(n, t); | 用n个值为t的元素创建容器          |
| c<T> c(n);    | n个值初始化元素容器c              |

对于迭代器赋初值，只要容器类型与元素类型兼容，即可复制，而无需严格一致

添加元素
| c.push_back(t)  | 尾部添加，只适用                        |
| c.push_front(t) | 首部tian添加，只适用于list和deque       |
| c.insert(p,t)   | 迭代器p所指向的元素前插入值为t的新元素  |
| c.insert(p,n,t) | 迭代器p前插入n个值为t的新元素           |
| c.insert(p,b,e) | 迭代器p前插入迭代器b和e标记范围内的元素 |

删除元素
| c.erase(p)    | 删除p指向的元素，返回值指向被删除元素后面的元素 |
| c.erase(b,e)  | 左闭右开，删除b和e内标记的元素                  |
| c.clear()     | 删除所有，返回void                              |
| c.pop_back()  | 删除最后一个元素                                |
| c.pop_front() | 删除第一个元素，返回void，只用于list，deque     |

容器赋值
| c1 = c2       | 删除容器c1的所有元素，然后将c2赋给c1                    |
| c1.swap(c2)   | c1、c2元素交换                                          |
| c.assign(b,e) | 将迭代器b和e标记范围内所有元素复制到c中，b,e必须不在c中 |
| c.assgin(n,t) | 将容器c重新设置为存储n个值为t的元素                     |

swap操作后，迭代器不会失效，只不过代码的容器换了(由c1变成c2)

capacity()  查看vector预留空间
reserve(i)  将预留空间设为i，i需大于默认预留空间

assign 只要求元素类型可兼容
swap   要求容器类型和元素类型可兼容

*为了使vector容量实现快速的内存分配，其实际分配的容量要比当前所需的空间多一些，用于缓解增加元素导致的内存释放申请的问题*

