language/C++.html

<div id="outline-container-org2110e6c" class="outline-3">
<h3 id="org2110e6c"><span class="section-number-3">1.5</span> 表达式</h3>
<div class="outline-text-3" id="text-1-5">
<p>
常规的和C相关<br />
强制转换static_cast、dynamic_cast、const_cast、reinterpret_cast<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span>::<span style="color: #AE81FF;">std</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">a</span> = <span style="color: #E6DB74;">'a'</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">b</span> = <span style="color: #F92672;">static_cast</span>&lt;<span style="color: #66D9EF;">char</span>&gt;(a);<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#27491;&#30830;&#65292;&#23558;char&#22411;&#25968;&#25454;&#36716;&#25442;&#25104;int&#22411;&#25968;&#25454;</span>

    <span style="color: #66D9EF;">double</span> *<span style="color: #FD971F;">c</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">double</span>;
    <span style="color: #66D9EF;">void</span> *<span style="color: #FD971F;">d</span> = <span style="color: #F92672;">static_cast</span>&lt;<span style="color: #66D9EF;">void</span>*&gt;(c);<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#27491;&#30830;&#65292;&#23558;double&#25351;&#38024;&#36716;&#25442;&#25104;void&#25351;&#38024;</span>

    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">e</span> = 10;
    <span style="color: #F92672;">const</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">f</span> = <span style="color: #F92672;">static_cast</span>&lt;<span style="color: #F92672;">const</span> <span style="color: #66D9EF;">int</span>&gt;(e);<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#27491;&#30830;&#65292;&#23558;int&#22411;&#25968;&#25454;&#36716;&#25442;&#25104;const int&#22411;&#25968;&#25454;</span>

    <span style="color: #F92672;">const</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">g</span> = 20;
    <span style="color: #66D9EF;">int</span> *<span style="color: #FD971F;">h</span> = <span style="color: #F92672;">static_cast</span>&lt;<span style="color: #66D9EF;">int</span>*&gt;(&amp;g);<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#32534;&#35793;&#38169;&#35823;&#65292;static_cast&#19981;&#33021;&#36716;&#25442;&#25481;g&#30340;const&#23646;&#24615;</span>
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf524b85" class="outline-3">
<h3 id="orgf524b85"><span class="section-number-3">1.6</span> 语句</h3>
<div class="outline-text-3" id="text-1-6">
<p>
只有构造函数可用 函数名():变量(值)的方法初始化变量<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">A</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>;
    <span style="color: #A6E22E; font-size: 130%;">A</span>():i(1) {};
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">A</span>() {};
};


<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">A</span> <span style="color: #FD971F;">x</span>;

    <span style="color: #AE81FF;">std</span>::cout &lt;&lt; x.i &lt;&lt; <span style="color: #AE81FF;">std</span>::endl;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4bfc20e" class="outline-3">
<h3 id="org4bfc20e"><span class="section-number-3">1.7</span> 函数</h3>
<div class="outline-text-3" id="text-1-7">
<p>
对于引用形参<br />
</p>
<ul class="org-ul">
<li>类型要严格匹配<br /></li>
<li>const不可传入非const<br /></li>
<li>右值/具有需要转换的类型的对象<br /></li>
</ul>

<p>
应将不修改相应实参的形参定义为const，因为这可以扩大函数的使用。因为非const引用形参既不能用const对象初始化，也不能用字面值或右值的表达试实参初始化<br />
</p>

<p>
如果为引用数组，编译器不会将数组实参转化为指针，而是传递数组的引用本身，则数组大小成为形参和实参的一部分，编译器会检查大小，也不可将引用形参当指针给其赋值，而是要真正当作数组<br />
</p>

<p>
<b>对于成员函数，如果在类中定义，则符号为weak，并且在本地文件里如果不调用函数则不会生成符号，而如果在类中声明类外定义，则为全局符号，如果文件内没使用也会生成符号</b><br />
</p>

<p>
<b>通常来说，在头文件(</b>.h)里声明类定义，在(<b>.cpp)里定义成员函数的实现</b><br />
</p>

<p>
对于临时对象，析构会在函数退出时调用<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">A</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #A6E22E; font-size: 130%;">A</span>() { <span style="color: #AE81FF;">std</span>::cout &lt;&lt; <span style="color: #E6DB74;">"A ctor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;};
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">A</span>() {<span style="color: #AE81FF;">std</span>::cout &lt;&lt; <span style="color: #E6DB74;">"A dtor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;};
};

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">B</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #A6E22E; font-size: 130%;">B</span>() { <span style="color: #AE81FF;">std</span>::cout &lt;&lt; <span style="color: #E6DB74;">"B ctor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;};
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">B</span>() {<span style="color: #AE81FF;">std</span>::cout &lt;&lt; <span style="color: #E6DB74;">"B dtor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;};
};


<span style="color: #75715E;">//</span><span style="color: #E6DB74;">A ctor</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">B ctor</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">B dtor</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">A dtor</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">A</span> <span style="color: #FD971F;">x</span>;
    <span style="color: #66D9EF;">B</span> <span style="color: #FD971F;">y</span>;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org04c573f" class="outline-3">
<h3 id="org04c573f"><span class="section-number-3">1.8</span> 标准I/O库</h3>
<div class="outline-text-3" id="text-1-8">
<p>
IO对象不可复制或赋值<br />
</p>
<ul class="org-ul">
<li>不可存于容器<br /></li>
<li>形参/返回类型不能为流类<br /></li>
</ul>

<p>
当输入流与输出流绑在一起时，任何读输入流的尝试都将首先刷新其输出流关联的缓冲区<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org5c23429" class="outline-2">
<h2 id="org5c23429"><span class="section-number-2">2</span> 容器和算法</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7891838" class="outline-3">
<h3 id="org7891838"><span class="section-number-3">2.1</span> 顺序容器</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">vector</td>
<td class="org-left">快速随机访问</td>
</tr>

<tr>
<td class="org-left">list</td>
<td class="org-left">快速插入/删除</td>
</tr>

<tr>
<td class="org-left">deque</td>
<td class="org-left">双端队列</td>
</tr>
</tbody>
</table>
<p>
在以上三种容器定义新的操作接口<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">stack</td>
<td class="org-left">栈</td>
</tr>

<tr>
<td class="org-left">queue</td>
<td class="org-left">队列</td>
</tr>

<tr>
<td class="org-left">priority_queue</td>
<td class="org-left">优先级队列</td>
</tr>
</tbody>
</table>

<p>
初始化<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">c&lt;T&gt; c;</td>
<td class="org-left">N.A.</td>
</tr>

<tr>
<td class="org-left">c&lt;T&gt; c(c2);</td>
<td class="org-left">N.A.</td>
</tr>

<tr>
<td class="org-left">c&lt;T&gt; c(b, e);</td>
<td class="org-left">b, e是迭代器,标示范围内元素的副本</td>
</tr>

<tr>
<td class="org-left">c&lt;T&gt; c(n, t);</td>
<td class="org-left">用n个值为t的元素创建容器</td>
</tr>

<tr>
<td class="org-left">c&lt;T&gt; c(n);</td>
<td class="org-left">n个值初始化元素容器c</td>
</tr>
</tbody>
</table>

<p>
对于迭代器赋初值，只要容器类型与元素类型兼容，即可复制，而无需严格一致<br />
</p>

<p>
添加元素<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">c.push_back(t)</td>
<td class="org-left">尾部添加，只适用</td>
</tr>

<tr>
<td class="org-left">c.push_front(t)</td>
<td class="org-left">首部tian添加，只适用于list和deque</td>
</tr>

<tr>
<td class="org-left">c.insert(p,t)</td>
<td class="org-left">迭代器p所指向的元素前插入值为t的新元素</td>
</tr>

<tr>
<td class="org-left">c.insert(p,n,t)</td>
<td class="org-left">迭代器p前插入n个值为t的新元素</td>
</tr>

<tr>
<td class="org-left">c.insert(p,b,e)</td>
<td class="org-left">迭代器p前插入迭代器b和e标记范围内的元素</td>
</tr>
</tbody>
</table>

<p>
删除元素<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">c.erase(p)</td>
<td class="org-left">删除p指向的元素，返回值指向被删除元素后面的元素</td>
</tr>

<tr>
<td class="org-left">c.erase(b,e)</td>
<td class="org-left">左闭右开，删除b和e内标记的元素</td>
</tr>

<tr>
<td class="org-left">c.clear()</td>
<td class="org-left">删除所有，返回void</td>
</tr>

<tr>
<td class="org-left">c.pop_back()</td>
<td class="org-left">删除最后一个元素</td>
</tr>

<tr>
<td class="org-left">c.pop_front()</td>
<td class="org-left">删除第一个元素，返回void，只用于list，deque</td>
</tr>
</tbody>
</table>

<p>
容器赋值<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">c1 = c2</td>
<td class="org-left">删除容器c1的所有元素，然后将c2赋给c1</td>
</tr>

<tr>
<td class="org-left">c1.swap(c2)</td>
<td class="org-left">c1、c2元素交换</td>
</tr>

<tr>
<td class="org-left">c.assign(b,e)</td>
<td class="org-left">将迭代器b和e标记范围内所有元素复制到c中，b,e必须不在c中</td>
</tr>

<tr>
<td class="org-left">c.assgin(n,t)</td>
<td class="org-left">将容器c重新设置为存储n个值为t的元素</td>
</tr>
</tbody>
</table>

<p>
swap操作后，迭代器不会失效，只不过代码的容器换了(由c1变成c2)<br />
</p>

<p>
capacity()  查看vector预留空间<br />
reserve(i)  将预留空间设为i，i需大于默认预留空间<br />
</p>

<p>
assign 只要求元素类型可兼容<br />
swap   要求容器类型和元素类型可兼容<br />
</p>

<p>
<b>为了使vector容量实现快速的内存分配，其实际分配的容量要比当前所需的空间多一些，用于缓解增加元素导致的内存释放申请的问题</b><br />
</p>
</div>
</div>
