language/C++.org
** 关联容器

通过key存储和读取元素 map与set
#+begin_src c++
#include <iostream>
#include <map>
using namespace std;

int main(int argc, char *argv[])
{
    std::map<int, string> m;
    map<int, string>::iterator iter;

    m.insert(pair<int, string>(1, "one"));
    m[2] = "two";

    for(iter = m.begin(); iter != m.end(); iter++)
        cout << iter->first << "  " << iter->second << endl;

    iter = m.find(1);
    cout << iter->first << "\n";

    m.erase(1);
    m.clear();

    return 0;
}
#+end_src

set 每个值只会出现一次，这个值就是键，键为只读不可更改
#+begin_src c++
#include <iostream>
#include <set>
using namespace std;

int main(int argc, char *argv[])
{
    set<int> s;
    set<int>::iterator iter;

    s.insert(1);
    s.insert(1);

    for(iter = s.begin(); iter != s.end(); iter++)
        cout << *iter << endl;

    iter = s.find(1);
    cout << *iter << "\n";

    s.erase(1);
    s.clear();

    return 0;
}
#+end_src

** 泛型算法
accumulate 以第三个入参类型为准，前两个迭代器范围是先强转为第三个参数类型再相加

#+begin_src c++
//===123456
#include <iostream>
#include <vector>
#include <numeric>
using namespace std;

int main(int argc, char *argv[])
{
    vector<string> x;

    x.push_back("123");
    x.push_back("456");

    string sum = accumulate(x.begin() , x.end() , string("==="));
    cout << sum << "\n";
    return 0;
}
#+end_src


迭代器种类
| 输入     | 只读，不能写，只支持自增      |
| 输出     | 只写，不能读，     只支持自增 |
| 前向     | 读和写，只支持自增            |
| 反向     | 读和写，支持自增自减          |
| 随机访问 | 读和写，支持完整迭代器        |

* 类和数据抽象
** 类
class 类名; //前向声明
在声明之后，定义之前，为不完全类型，不可定义对象，只能用于定义指向该类型的指针及引用或者用于定义使用该类型作为形参类型或返回类型的函数

类定义，编译成员声明，所有成员出现后，才编译定义本身

类成员定义中的名字查找
1. 检查成员函数局部作用域声明
2. 检查类成员的声明
3. 检查此成员函数之前的作用域中出现的声明

建立对象时
A x;   - 定义对象x
A x(); - 声明返回值类型为A的x函数

构造函数初始化顺序为成员定义的次序
如果类无默认的构造函数，则不能用作动态数组的元素类型

友元 - 类对其非公有成员访问授予指定函数/类

static数据成员为类域中的全局变量，必须在类定义体外部定义一次
static成员函数为类域中的全局函数，无this指针，如果在类外定义，无需static
#+begin_src c++
#include <iostream>
#include <vector>
#include <numeric>
using namespace std;

class A
{
public:
    A();
    A(int i) { cout << "ctor2" << "\n";};
    A(int i, int j) { cout << "ctor3" << "\n";};
    virtual ~A() {};
    static int i;
    static void x();
};

A::A()
{
    cout << "ctor1" << "\n";
}

int A::i = 10;

void A::x()
{

}

int main(int argc, char *argv[])
{
    A x;
    A y(1);
    A z(1, 2);
    return 0;
}
#+end_src

