language/C++.html

<div id="outline-container-org256b510" class="outline-3">
<h3 id="org256b510"><span class="section-number-3">2.2</span> 关联容器</h3>
<div class="outline-text-3" id="text-2-2">
<p>
通过key存储和读取元素 map与set<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;map&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #AE81FF;">std</span>::<span style="color: #66D9EF;">map</span>&lt;<span style="color: #66D9EF;">int</span>, <span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">m</span>;
    <span style="color: #AE81FF;">map</span>&lt;<span style="color: #66D9EF;">int</span>, <span style="color: #66D9EF;">string</span>&gt;::<span style="color: #66D9EF;">iterator</span> <span style="color: #FD971F;">iter</span>;

    m.insert(pair&lt;<span style="color: #66D9EF;">int</span>, string&gt;(1, <span style="color: #E6DB74;">"one"</span>));
    m[2] = <span style="color: #E6DB74;">"two"</span>;

    <span style="color: #F92672;">for</span>(iter = m.begin(); iter != m.end(); iter++)
        cout &lt;&lt; iter-&gt;first &lt;&lt; <span style="color: #E6DB74;">"  "</span> &lt;&lt; iter-&gt;second &lt;&lt; endl;

    iter = m.find(1);
    cout &lt;&lt; iter-&gt;first &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;

    m.erase(1);
    m.clear();

    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<p>
set 每个值只会出现一次，这个值就是键，键为只读不可更改<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;set&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">set</span>&lt;<span style="color: #66D9EF;">int</span>&gt; <span style="color: #FD971F;">s</span>;
    <span style="color: #AE81FF;">set</span>&lt;<span style="color: #66D9EF;">int</span>&gt;::<span style="color: #66D9EF;">iterator</span> <span style="color: #FD971F;">iter</span>;

    s.insert(1);
    s.insert(1);

    <span style="color: #F92672;">for</span>(iter = s.begin(); iter != s.end(); iter++)
        cout &lt;&lt; *iter &lt;&lt; endl;

    iter = s.find(1);
    cout &lt;&lt; *iter &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;

    s.erase(1);
    s.clear();

    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e9a6f6" class="outline-3">
<h3 id="org8e9a6f6"><span class="section-number-3">2.3</span> 泛型算法</h3>
<div class="outline-text-3" id="text-2-3">
<p>
accumulate 以第三个入参类型为准，前两个迭代器范围是先强转为第三个参数类型再相加<br />
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #75715E;">//</span><span style="color: #E6DB74;">===123456</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;vector&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;numeric&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">vector</span>&lt;<span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">x</span>;

    x.push_back(<span style="color: #E6DB74;">"123"</span>);
    x.push_back(<span style="color: #E6DB74;">"456"</span>);

    <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">sum</span> = accumulate(x.begin() , x.end() , string(<span style="color: #E6DB74;">"==="</span>));
    cout &lt;&lt; sum &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>


<p>
迭代器种类<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">输入</td>
<td class="org-left">只读，不能写，只支持自增</td>
</tr>

<tr>
<td class="org-left">输出</td>
<td class="org-left">只写，不能读，     只支持自增</td>
</tr>

<tr>
<td class="org-left">前向</td>
<td class="org-left">读和写，只支持自增</td>
</tr>

<tr>
<td class="org-left">反向</td>
<td class="org-left">读和写，支持自增自减</td>
</tr>

<tr>
<td class="org-left">随机访问</td>
<td class="org-left">读和写，支持完整迭代器</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org18cae47" class="outline-2">
<h2 id="org18cae47"><span class="section-number-2">3</span> 类和数据抽象</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3f5107b" class="outline-3">
<h3 id="org3f5107b"><span class="section-number-3">3.1</span> 类</h3>
<div class="outline-text-3" id="text-3-1">
<p>
class 类名; //前向声明<br />
在声明之后，定义之前，为不完全类型，不可定义对象，只能用于定义指向该类型的指针及引用或者用于定义使用该类型作为形参类型或返回类型的函数<br />
</p>

<p>
类定义，编译成员声明，所有成员出现后，才编译定义本身<br />
</p>

<p>
类成员定义中的名字查找<br />
</p>
<ol class="org-ol">
<li>检查成员函数局部作用域声明<br /></li>
<li>检查类成员的声明<br /></li>
<li>检查此成员函数之前的作用域中出现的声明<br /></li>
</ol>

<p>
建立对象时<br />
A x;   - 定义对象x<br />
A x(); - 声明返回值类型为A的x函数<br />
</p>

<p>
构造函数初始化顺序为成员定义的次序<br />
如果类无默认的构造函数，则不能用作动态数组的元素类型<br />
</p>

<p>
友元 - 类对其非公有成员访问授予指定函数/类<br />
</p>

<p>
static数据成员为类域中的全局变量，必须在类定义体外部定义一次<br />
static成员函数为类域中的全局函数，无this指针，如果在类外定义，无需static<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;vector&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;numeric&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">A</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #A6E22E; font-size: 130%;">A</span>();
    <span style="color: #A6E22E; font-size: 130%;">A</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>) { cout &lt;&lt; <span style="color: #E6DB74;">"ctor2"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;};
    <span style="color: #A6E22E; font-size: 130%;">A</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>, <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">j</span>) { cout &lt;&lt; <span style="color: #E6DB74;">"ctor3"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;};
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">A</span>() {};
    <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>;
    <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">x</span>();
};

<span style="color: #AE81FF;">A</span>::<span style="color: #A6E22E; font-size: 130%;">A</span>()
{
    cout &lt;&lt; <span style="color: #E6DB74;">"ctor1"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
}

<span style="color: #66D9EF;">int</span> <span style="color: #AE81FF;">A</span>::<span style="color: #FD971F;">i</span> = 10;

<span style="color: #66D9EF;">void</span> <span style="color: #AE81FF;">A</span>::<span style="color: #A6E22E; font-size: 130%;">x</span>()
{

}

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">A</span> <span style="color: #FD971F;">x</span>;
    <span style="color: #66D9EF;">A</span> <span style="color: #FD971F;">y</span>(1);
    <span style="color: #66D9EF;">A</span> <span style="color: #FD971F;">z</span>(1, 2);
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>
</div>
</div>
