language/C++.org
** 复制控制
- 复制构造函数 未定义会自动生成一个
接受单个类类型引用实参
定义复制构造函数为private，实现防止复制

#+begin_src c++
#include<iostream>
using namespace std;
class Test
{
private:
    int a;
public:
    //构造函数
    Test(int b)
    {
        a=b;
        printf("constructor is called\n");
    }
    //拷贝构造函数
    Test(const Test & c)
    {
        a=c.a;
        printf("copy constructor is called\n");
    }
    //析构函数
    ~Test()
    {
        cout<<"destructor is called\n";
    }
    void Show()
    {
        cout<<a<<endl;
    }
};

int main()
{
    Test A(100);
    Test B=A;
    B.Show();
    return 0;
}
#+end_src

- 赋值操作符 未定义会自动生成一个
- 析构函数
与类名相同，只是在函数名前面加一个位取反符~，以区别于构造函数。
不带任何参数，也没有返回值（包括void类型）
只能有一个析构函数，不能重载。
如果用户没有编写析构函数，编译系统会自动生成一个缺省的析构函数（即使自定义了析构函数，编译器也总是会为我们合成一个析构函数，并且如果自定义了析构函数，编译器在执行时会先调用自定义的析构函数再调用合成的析构函数）
你写下的析构函数并不是真正的完整版的析构函数，一定要加上编译器自动生成的那部分，只是，对若干简单类，编译器自动生成的那部分为空。
- 管理指针
a. 一个带指针成员，采取常规指针型行为
b. 智能指针
使用计数
创建类的新对象，初始化为1
作为另一个对象副本创建时，增值
对一个对象赋值，减少左操作数的个数，并增加右操作数计数
A中定义指向计数类的指针
#+begin_src c++
#include <iostream>
using namespace std;

int main()
{
	string *s1 = new string("s1");

	shared_ptr<string> ps1(s1);
	shared_ptr<string> ps2;
	ps2 = ps1;

	cout << ps1.use_count()<<endl;	//2
	cout<<ps2.use_count()<<endl;	//2
	cout << ps1.unique()<<endl;	//0

	string *s3 = new string("s3");
	shared_ptr<string> ps3(s3);

	cout << (ps1.get()) << endl;	//033AEB48
	cout << ps3.get() << endl;	//033B2C50
	swap(ps1, ps3);	//交换所拥有的对象
	cout << (ps1.get())<<endl;	//033B2C50
	cout << ps3.get() << endl;	//033AEB48

	cout << ps1.use_count()<<endl;	//1
	cout << ps2.use_count() << endl;	//2
	ps2 = ps1;
	cout << ps1.use_count()<<endl;	//2
	cout << ps2.use_count() << endl;	//2
	ps1.reset();	//放弃ps1的拥有权，引用计数的减少
	cout << ps1.use_count()<<endl;	//0
	cout << ps2.use_count()<<endl;	//1
}
#+end_src

** 重载操作符与转换

可以像调用普通函数一样，调用重载操作符函数

原则
- 不重载具有内置含义的操作符
- 大多数操作符对类对象没有意义
- 如果类有算术或位操作，最好也提供相应的复合赋值操作符
- 如果使用关联容器，应定义相等和关系操作符

选择成员/非成员实现操作符重载原则
- =,[],() 必须为成员
- 复合赋值通常定义为类成员
- 改变对象状态/给定类型紧密联系的操作符，类成员
- 对称的操作符，最好定义为普通非成员
- I/O操作符，必须为非成员函数


| 重载操作符 | 原则                                                                                                                   |
|------------+------------------------------------------------------------------------------------------------------------------------|
| <<         | 要指明错误等匹配标准库的行为和方法，非成员实现，对应类将其设为友元                                                     |
| +          | 并不改变操作符的状态，操作符为const对象引用，并产生返回一个新对象，所以+=比+更高效                                     |
| =          | 必须为类成员，可以重载，一般情况下均返回对象引用                                                                       |
| []         | 必须为类成员函数，因其需要在左右操作数合法，需返回值为引用                                                             |
| * ->       | ->必须定义为类成员，不可有显式形参                                                                                     |
| ++, --     | 为了和内置类型一致，前缀式操作符应返回被增量或减量的对象引用，后缀式操作符比前缀多一个int的无用参数，即operator++(int) |
| ()         | 必须为类成员，重载此操作符被称为函数对象                                                                               |

一般将算法和关系操作符定义为非成员函数，将赋值操作符定义为成员
操作符+返回一个右值，而复合赋值返回对左操作数的引用
定义重载操作符的目的是为了方便使用库函数

下标操作符一般定义两个版本
- 非const引用并返回引用
- const成员并返回const引用

成员访问操作符(*, ->)，

对于指针x->p
- x为指针，指向具有名为action对象，则为调用action成员
- action如定义operator->，则x->p与x.operator->()相同
- x是对象本身，同时定义了operator->，则调用x.operator->()后用返回值执行->p
重载箭头操作符必须返回指向类类型的指针，或者返回定义了自已的箭头操作符的类类型对象

转换函数必须为成员函数，不可指定返回类型，形参表必须为空
#+begin_src c++
operator Type ()  // operator 表示定义类型转换函数，Type 表示返回值，没有参数；
{    // 函数体表示普通的函数体内容；
    Type ret;

    // ...

    return ret;
}
#+end_src

使用构造函数可进行隐式转换，且构造形参不必与所提供的类型完全匹配
如果两个转换操作符都可用在一个调用中，而且在转换函数之后存在标准转换，则根据该标准转换的类别选择最佳匹配，否则二义性出错
当两个构造函数的定义转换都可以使用时，如果存在构造函数实参所需的标准转换，则用标准转换的类型选择最佳匹配，否则二义性出错

同时定义非成员与成员函数，实现同一功能的重载操作符，会造成二义性

- 不要定义相互转换的类
- 避免内置算术类型的转换，即不要定义接受算术类型的重载，不要定义转换到一个以上算术类型

类类型转换之后不能再跟另一个类类型转换，即A转B，B转C，但A不能转为C
当类都定义了转换，会造成二义性，避免的方法:不要编写互相隐式转换成对的类

