language/C++.html

<div id="outline-container-orgecfff51" class="outline-3">
<h3 id="orgecfff51"><span class="section-number-3">3.2</span> 复制控制</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>复制构造函数 未定义会自动生成一个<br /></li>
</ul>
<p>
接受单个类类型引用实参<br />
定义复制构造函数为private，实现防止复制<br />
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span><span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;
<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">Test</span>
{
<span style="color: #F92672;">private</span>:
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span>;
<span style="color: #F92672;">public</span>:
    <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#26500;&#36896;&#20989;&#25968;</span>
    <span style="color: #A6E22E; font-size: 130%;">Test</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">b</span>)
    {
        a=b;
        printf(<span style="color: #E6DB74;">"constructor is called\n"</span>);
    }
    <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#25335;&#36125;&#26500;&#36896;&#20989;&#25968;</span>
    <span style="color: #A6E22E; font-size: 130%;">Test</span>(<span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Test</span> &amp; <span style="color: #FD971F;">c</span>)
    {
        a=c.a;
        printf(<span style="color: #E6DB74;">"copy constructor is called\n"</span>);
    }
    <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#26512;&#26500;&#20989;&#25968;</span>
    ~<span style="color: #A6E22E; font-size: 130%;">Test</span>()
    {
        cout&lt;&lt;<span style="color: #E6DB74;">"destructor is called\n"</span>;
    }
    <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">Show</span>()
    {
        cout&lt;&lt;a&lt;&lt;endl;
    }
};

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>()
{
    <span style="color: #66D9EF;">Test</span> <span style="color: #FD971F;">A</span>(100);
    <span style="color: #66D9EF;">Test</span> <span style="color: #FD971F;">B</span>=A;
    B.Show();
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<ul class="org-ul">
<li>赋值操作符 未定义会自动生成一个<br /></li>
<li>析构函数<br /></li>
</ul>
<p>
与类名相同，只是在函数名前面加一个位取反符~，以区别于构造函数。<br />
不带任何参数，也没有返回值（包括void类型）<br />
只能有一个析构函数，不能重载。<br />
如果用户没有编写析构函数，编译系统会自动生成一个缺省的析构函数（即使自定义了析构函数，编译器也总是会为我们合成一个析构函数，并且如果自定义了析构函数，编译器在执行时会先调用自定义的析构函数再调用合成的析构函数）<br />
你写下的析构函数并不是真正的完整版的析构函数，一定要加上编译器自动生成的那部分，只是，对若干简单类，编译器自动生成的那部分为空。<br />
</p>
<ul class="org-ul">
<li>管理指针<br /></li>
</ul>
<p>
a. 一个带指针成员，采取常规指针型行为<br />
b. 智能指针<br />
使用计数<br />
创建类的新对象，初始化为1<br />
作为另一个对象副本创建时，增值<br />
对一个对象赋值，减少左操作数的个数，并增加右操作数计数<br />
A中定义指向计数类的指针<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>()
{
    <span style="color: #66D9EF;">string</span> *<span style="color: #FD971F;">s1</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">string</span>(<span style="color: #E6DB74;">"s1"</span>);

    <span style="color: #66D9EF;">shared_ptr</span>&lt;<span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">ps1</span>(s1);
    <span style="color: #66D9EF;">shared_ptr</span>&lt;<span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">ps2</span>;
    ps2 = ps1;

    cout &lt;&lt; ps1.use_count()&lt;&lt;endl;  <span style="color: #75715E;">//</span><span style="color: #E6DB74;">2</span>
    cout&lt;&lt;ps2.use_count()&lt;&lt;endl;    <span style="color: #75715E;">//</span><span style="color: #E6DB74;">2</span>
    cout &lt;&lt; ps1.unique()&lt;&lt;endl; <span style="color: #75715E;">//</span><span style="color: #E6DB74;">0</span>

    <span style="color: #66D9EF;">string</span> *<span style="color: #FD971F;">s3</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">string</span>(<span style="color: #E6DB74;">"s3"</span>);
    <span style="color: #66D9EF;">shared_ptr</span>&lt;<span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">ps3</span>(s3);

    cout &lt;&lt; (ps1.get()) &lt;&lt; endl;    <span style="color: #75715E;">//</span><span style="color: #E6DB74;">033AEB48</span>
    cout &lt;&lt; ps3.get() &lt;&lt; endl;  <span style="color: #75715E;">//</span><span style="color: #E6DB74;">033B2C50</span>
    swap(ps1, ps3); <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#20132;&#25442;&#25152;&#25317;&#26377;&#30340;&#23545;&#35937;</span>
    cout &lt;&lt; (ps1.get())&lt;&lt;endl;  <span style="color: #75715E;">//</span><span style="color: #E6DB74;">033B2C50</span>
    cout &lt;&lt; ps3.get() &lt;&lt; endl;  <span style="color: #75715E;">//</span><span style="color: #E6DB74;">033AEB48</span>

    cout &lt;&lt; ps1.use_count()&lt;&lt;endl;  <span style="color: #75715E;">//</span><span style="color: #E6DB74;">1</span>
    cout &lt;&lt; ps2.use_count() &lt;&lt; endl;    <span style="color: #75715E;">//</span><span style="color: #E6DB74;">2</span>
    ps2 = ps1;
    cout &lt;&lt; ps1.use_count()&lt;&lt;endl;  <span style="color: #75715E;">//</span><span style="color: #E6DB74;">2</span>
    cout &lt;&lt; ps2.use_count() &lt;&lt; endl;    <span style="color: #75715E;">//</span><span style="color: #E6DB74;">2</span>
    ps1.reset();    <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#25918;&#24323;ps1&#30340;&#25317;&#26377;&#26435;&#65292;&#24341;&#29992;&#35745;&#25968;&#30340;&#20943;&#23569;</span>
    cout &lt;&lt; ps1.use_count()&lt;&lt;endl;  <span style="color: #75715E;">//</span><span style="color: #E6DB74;">0</span>
    cout &lt;&lt; ps2.use_count()&lt;&lt;endl;  <span style="color: #75715E;">//</span><span style="color: #E6DB74;">1</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org77c020a" class="outline-3">
<h3 id="org77c020a"><span class="section-number-3">3.3</span> 重载操作符与转换</h3>
<div class="outline-text-3" id="text-3-3">
<p>
可以像调用普通函数一样，调用重载操作符函数<br />
</p>

<p>
原则<br />
</p>
<ul class="org-ul">
<li>不重载具有内置含义的操作符<br /></li>
<li>大多数操作符对类对象没有意义<br /></li>
<li>如果类有算术或位操作，最好也提供相应的复合赋值操作符<br /></li>
<li>如果使用关联容器，应定义相等和关系操作符<br /></li>
</ul>

<p>
选择成员/非成员实现操作符重载原则<br />
</p>
<ul class="org-ul">
<li>=,[],() 必须为成员<br /></li>
<li>复合赋值通常定义为类成员<br /></li>
<li>改变对象状态/给定类型紧密联系的操作符，类成员<br /></li>
<li>对称的操作符，最好定义为普通非成员<br /></li>
<li>I/O操作符，必须为非成员函数<br /></li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">重载操作符</th>
<th scope="col" class="org-left">原则</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&lt;&lt;</td>
<td class="org-left">要指明错误等匹配标准库的行为和方法，非成员实现，对应类将其设为友元</td>
</tr>

<tr>
<td class="org-left">+</td>
<td class="org-left">并不改变操作符的状态，操作符为const对象引用，并产生返回一个新对象，所以+=比+更高效</td>
</tr>

<tr>
<td class="org-left">=</td>
<td class="org-left">必须为类成员，可以重载，一般情况下均返回对象引用</td>
</tr>

<tr>
<td class="org-left">[]</td>
<td class="org-left">必须为类成员函数，因其需要在左右操作数合法，需返回值为引用</td>
</tr>

<tr>
<td class="org-left">* -&gt;</td>
<td class="org-left">-&gt;必须定义为类成员，不可有显式形参</td>
</tr>

<tr>
<td class="org-left">++, --</td>
<td class="org-left">为了和内置类型一致，前缀式操作符应返回被增量或减量的对象引用，后缀式操作符比前缀多一个int的无用参数，即operator++(int)</td>
</tr>

<tr>
<td class="org-left">()</td>
<td class="org-left">必须为类成员，重载此操作符被称为函数对象</td>
</tr>
</tbody>
</table>

<p>
一般将算法和关系操作符定义为非成员函数，将赋值操作符定义为成员<br />
操作符+返回一个右值，而复合赋值返回对左操作数的引用<br />
定义重载操作符的目的是为了方便使用库函数<br />
</p>

<p>
下标操作符一般定义两个版本<br />
</p>
<ul class="org-ul">
<li>非const引用并返回引用<br /></li>
<li>const成员并返回const引用<br /></li>
</ul>

<p>
成员访问操作符(*, -&gt;)，<br />
</p>

<p>
对于指针x-&gt;p<br />
</p>
<ul class="org-ul">
<li>x为指针，指向具有名为action对象，则为调用action成员<br /></li>
<li>action如定义operator-&gt;，则x-&gt;p与x.operator-&gt;()相同<br /></li>
<li>x是对象本身，同时定义了operator-&gt;，则调用x.operator-&gt;()后用返回值执行-&gt;p<br /></li>
</ul>
<p>
重载箭头操作符必须返回指向类类型的指针，或者返回定义了自已的箭头操作符的类类型对象<br />
</p>

<p>
转换函数必须为成员函数，不可指定返回类型，形参表必须为空<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">operator</span> <span style="color: #66D9EF;">Type</span> ()  <span style="color: #75715E;">// </span><span style="color: #E6DB74;">operator &#34920;&#31034;&#23450;&#20041;&#31867;&#22411;&#36716;&#25442;&#20989;&#25968;&#65292;Type &#34920;&#31034;&#36820;&#22238;&#20540;&#65292;&#27809;&#26377;&#21442;&#25968;&#65307;</span>
{    <span style="color: #75715E;">// </span><span style="color: #E6DB74;">&#20989;&#25968;&#20307;&#34920;&#31034;&#26222;&#36890;&#30340;&#20989;&#25968;&#20307;&#20869;&#23481;&#65307;</span>
    <span style="color: #66D9EF;">Type</span> <span style="color: #FD971F;">ret</span>;

    <span style="color: #75715E;">// </span><span style="color: #E6DB74;">...</span>

    <span style="color: #F92672;">return</span> ret;
}
</pre>
</div>

<p>
使用构造函数可进行隐式转换，且构造形参不必与所提供的类型完全匹配<br />
如果两个转换操作符都可用在一个调用中，而且在转换函数之后存在标准转换，则根据该标准转换的类别选择最佳匹配，否则二义性出错<br />
当两个构造函数的定义转换都可以使用时，如果存在构造函数实参所需的标准转换，则用标准转换的类型选择最佳匹配，否则二义性出错<br />
</p>

<p>
同时定义非成员与成员函数，实现同一功能的重载操作符，会造成二义性<br />
</p>

<ul class="org-ul">
<li>不要定义相互转换的类<br /></li>
<li>避免内置算术类型的转换，即不要定义接受算术类型的重载，不要定义转换到一个以上算术类型<br /></li>
</ul>

<p>
类类型转换之后不能再跟另一个类类型转换，即A转B，B转C，但A不能转为C<br />
当类都定义了转换，会造成二义性，避免的方法:不要编写互相隐式转换成对的类<br />
</p>
</div>
</div>
