language/C++.org
** 面向对象编程

如果函数在基类中声明为虚函数，则一直为虚函数
C++不要求编译器对象的基类部分和派生部分要物理上连续
*任何可以在基类对象上执行的操作也可以通过派生类对象使用*
对象是非动态的，可用强制标识作用域覆盖虚函数机制x->y::fun();
为虚函数的基类版本定义的默认实参将传经派生类定义的版本，派生使用基类的默认实参而不使用自已的
无论派生列表中的访问标号，派生类对基本类有相同的访问，但会控制派生类对象对基类的成员访问，同时派生访问标号还控制来自非直接派生类的访问
无论派生出多少，基类的static变量只有一个实例

*派生类对象的地址，指针，引用可初始化基类，如B继承A，则可以A* x = new B;但编译器不会自动将派生对象转换为基类类型对象*

函数不可能为静态函数同时为虚函数
*继承类访问基类的权限与程序中其他部分一样，不可访问private*
A派生B, A有一个protected C，只能在B的成员函数中访问C，外部不可访问

只有通过引用/指针调用，虚函数才在运行时确定
#+begin_src c++
#include <iostream>
using namespace std;

class A
{
public:
    A() {
        cout << "A ctor" << "\n";
    }
    virtual ~A() {
        cout << "A dtor" << "\n";
    }

public:
    virtual void show()
        {
            cout << "A show" << "\n";
        }
};

class B : public A
{
public:
    B() {
        cout << "B ctor" << "\n";
    }
    virtual ~B() {
        cout << "B dtor" << "\n";
    }

    virtual void show()
        {
            A::show();
            cout << "B show" << "\n";
        }
};

int main(int argc, char *argv[])
{
    A *x = new B();
    x->show();
    delete x;
    return 0;
}
#+end_src


如果派生类显示定义了复制构造/赋值，则覆盖了默认定义需要负责对基类成份及成员进行赋值， *赋值操作符履须防止自身赋值*

派生类析构函数不负责撤消基类成员
基类中的析构函数，必须为虚函数，以防止指向派生基类指针释放错误

*如果在构造/析构函数中调用虚函数，则运行的是为构造/析构自身类类型定义的版本*
#+begin_src c++
//A show
//A ctor
//B show
//B ctor
//B dtor
//A dtor
#include <iostream>
using namespace std;

class A
{
public:
    A() {
        show();
        cout << "A ctor" << "\n";
    }
    virtual ~A() {
        cout << "A dtor" << "\n";
    }

public:
    virtual void show()
        {
            cout << "A show" << "\n";
        }
};

class B : public A
{
public:
    B() {
        show();
        cout << "B ctor" << "\n";
    }
    virtual ~B() {
        cout << "B dtor" << "\n";
    }

    virtual void show()
        {
            cout << "B show" << "\n";
        }
};

int main(int argc, char *argv[])
{
    A *x = new B();
    delete x;
    return 0;
}
#+end_src
对象的引用/指针的静止类型决定可访问的成员，如基类指针不可访问派生成员
名字冲突时，派生将覆盖基类成员， *对于成员函数也是如此，原因是编译器会查到第一个名字就结束*，本质原因是基类和派生不在同一作用域
名字查找
- 确定对象，引用指针，静态类型
- 派生到基类查找
- 找到后检查调用合法性
- 如果虚函数同时通过指针或引用，则根据实际绑定类型

派生类的返回类型必须与基类实例返回完全一致，除非虚函数的基类实例返回类类型的引用/指针，则其派生类实例可返回基类实例返回类型的派生类

