language/C++.html

<div id="outline-container-orgf9ac70d" class="outline-3">
<h3 id="orgf9ac70d"><span class="section-number-3">3.4</span> 面向对象编程</h3>
<div class="outline-text-3" id="text-3-4">
<p>
如果函数在基类中声明为虚函数，则一直为虚函数<br />
C++不要求编译器对象的基类部分和派生部分要物理上连续<br />
<b>任何可以在基类对象上执行的操作也可以通过派生类对象使用</b><br />
对象是非动态的，可用强制标识作用域覆盖虚函数机制x-&gt;y::fun();<br />
为虚函数的基类版本定义的默认实参将传经派生类定义的版本，派生使用基类的默认实参而不使用自已的<br />
无论派生列表中的访问标号，派生类对基本类有相同的访问，但会控制派生类对象对基类的成员访问，同时派生访问标号还控制来自非直接派生类的访问<br />
无论派生出多少，基类的static变量只有一个实例<br />
</p>

<p>
<b>派生类对象的地址，指针，引用可初始化基类，如B继承A，则可以A</b> x = new B;但编译器不会自动将派生对象转换为基类类型对象*<br />
</p>

<p>
函数不可能为静态函数同时为虚函数<br />
<b>继承类访问基类的权限与程序中其他部分一样，不可访问private</b><br />
A派生B, A有一个protected C，只能在B的成员函数中访问C，外部不可访问<br />
</p>

<p>
只有通过引用/指针调用，虚函数才在运行时确定<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">A</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #A6E22E; font-size: 130%;">A</span>() {
        cout &lt;&lt; <span style="color: #E6DB74;">"A ctor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    }
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">A</span>() {
        cout &lt;&lt; <span style="color: #E6DB74;">"A dtor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    }

<span style="color: #F92672;">public</span>:
    <span style="color: #F92672;">virtual</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">show</span>()
        {
            cout &lt;&lt; <span style="color: #E6DB74;">"A show"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
        }
};

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">B</span> : <span style="color: #F92672;">public</span> <span style="color: #66D9EF;">A</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #A6E22E; font-size: 130%;">B</span>() {
        cout &lt;&lt; <span style="color: #E6DB74;">"B ctor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    }
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">B</span>() {
        cout &lt;&lt; <span style="color: #E6DB74;">"B dtor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    }

    <span style="color: #F92672;">virtual</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">show</span>()
        {
            <span style="color: #AE81FF;">A</span>::show();
            cout &lt;&lt; <span style="color: #E6DB74;">"B show"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
        }
};

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">A</span> *<span style="color: #FD971F;">x</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">B</span>();
    x-&gt;show();
    <span style="color: #F92672;">delete</span> x;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>


<p>
如果派生类显示定义了复制构造/赋值，则覆盖了默认定义需要负责对基类成份及成员进行赋值， <b>赋值操作符履须防止自身赋值</b><br />
</p>

<p>
派生类析构函数不负责撤消基类成员<br />
基类中的析构函数，必须为虚函数，以防止指向派生基类指针释放错误<br />
</p>

<p>
<b>如果在构造/析构函数中调用虚函数，则运行的是为构造/析构自身类类型定义的版本</b><br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #75715E;">//</span><span style="color: #E6DB74;">A show</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">A ctor</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">B show</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">B ctor</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">B dtor</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">A dtor</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">A</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #A6E22E; font-size: 130%;">A</span>() {
        show();
        cout &lt;&lt; <span style="color: #E6DB74;">"A ctor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    }
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">A</span>() {
        cout &lt;&lt; <span style="color: #E6DB74;">"A dtor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    }

<span style="color: #F92672;">public</span>:
    <span style="color: #F92672;">virtual</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">show</span>()
        {
            cout &lt;&lt; <span style="color: #E6DB74;">"A show"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
        }
};

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">B</span> : <span style="color: #F92672;">public</span> <span style="color: #66D9EF;">A</span>
{
<span style="color: #F92672;">public</span>:
    <span style="color: #A6E22E; font-size: 130%;">B</span>() {
        show();
        cout &lt;&lt; <span style="color: #E6DB74;">"B ctor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    }
    <span style="color: #F92672;">virtual</span> ~<span style="color: #A6E22E; font-size: 130%;">B</span>() {
        cout &lt;&lt; <span style="color: #E6DB74;">"B dtor"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    }

    <span style="color: #F92672;">virtual</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">show</span>()
        {
            cout &lt;&lt; <span style="color: #E6DB74;">"B show"</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
        }
};

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">A</span> *<span style="color: #FD971F;">x</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">B</span>();
    <span style="color: #F92672;">delete</span> x;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>
<p>
对象的引用/指针的静止类型决定可访问的成员，如基类指针不可访问派生成员<br />
名字冲突时，派生将覆盖基类成员， *对于成员函数也是如此，原因是编译器会查到第一个名字就结束*，本质原因是基类和派生不在同一作用域<br />
名字查找<br />
</p>
<ul class="org-ul">
<li>确定对象，引用指针，静态类型<br /></li>
<li>派生到基类查找<br /></li>
<li>找到后检查调用合法性<br /></li>
<li>如果虚函数同时通过指针或引用，则根据实际绑定类型<br /></li>
</ul>

<p>
派生类的返回类型必须与基类实例返回完全一致，除非虚函数的基类实例返回类类型的引用/指针，则其派生类实例可返回基类实例返回类型的派生类<br />
</p>
</div>
</div>
