language/C++.org
** 模板和泛型编程

template <class/typename T>
template <class T> inline fn(int i) 函数模板

模板形参作用域，声明模板形参之后直到模板声明或定义的末尾处使用

模板形参的名字只能在同一模板形参表使用一次

模板可声明不定义，同一模板的声明和定义中，形参名字不必相同
#+begin_src c++
#include <iostream>
using namespace std;

template<class U> U calc(U&, U&);
template <typename T>
inline T calc (T& a, T& b)
{
    return a + b;
}

int main(int argc, char *argv[])
{
    int i = 1;
    int j = 2;

    cout << calc(i, j) << "\n";
    return 0;
}
#+end_src

如果在模板定义内部指定类型，需用typename显示指出

泛型编程原则，对实参需要尽可以少

多个类型形参的实参必须完全匹配，模板函数不会转换实参以匹配已有的实例化，相反，会产生新的实例，除非
- const可用非const对象的引用/指针调用
- 数组和函数可转化为对应的指针

函数模板定义在别的源文件中使用，可用export，而类定义不用，类成员函数需要

模板设计者：保证所有不依赖于模板形参的名字在模板本身的作用域中定义
模板用户  : 与用来实例化模板的类型相关的所有函数类型和操作符的声明可见

类模板成员函数只有为程序所用才进行实例化
g++会合并同一种类型的模板实例化（目标文件会生成重复的函数），模板实例的符号是弱符号

类模板可以有静态成员，但因为其有不同类型的实例，所以不可通过类模板名直接引用静态成员
#+begin_src c++
#include<iostream>
using namespace std;
const double PI=3.14159;
template<typename T>
class Circle{
    T radius;
public:
    static int total;
    Circle(T r=0){
        radius=r;
        total++;
    }
    void SetRadius(T r){
        radius=r;
    }
    T GetRadius()const{
        return radius;
    }
    double GetArea()const{
        return PI*radius*radius;
    }
    static int ShowTotal();
};

template<typename T>
int Circle<T>::total=0;

template<typename T>
int Circle<T>::ShowTotal(){
    return total;
}

int main(){
    Circle<int>A,B;
    A.SetRadius(10);
    cout<<A.GetArea()<<endl;
    B.SetRadius(100);
    cout<<B.GetArea()<<endl;
    cout<<Circle<int>::ShowTotal()<<endl;
    cout << Circle<int>::total << "\n";
    return 0;
}
#+end_src

函数模式也可以重载，规则如普通重载，但是也存在二义性

*当模板与普通函数同时匹配且优先级相等时，普通函数优先*
* 高级主题
异常处理为与对象类型匹配并且离抛出异常位置最近
执行throw时，不会执行跟在throw后面的语句，而是将其转移至匹配的catch，throw将创建对象，同时传递给对应的catch，最后处理完异常后撤销
*异常对象通过复制被抛出表达式的结果创建，所以该结果必须为可复制类型*
被抛出对象的静态编译类型决定异常对象的类型
抛出指针通常是个坏主意，因为很可能指针指向的为局部变量，从而引起严重错误
析构函数应从不抛出异常，以免再次触发异常使得强制程序退出，但构造函数可经常抛出异常，但要保证适时撤销
异常以类似于将实参传递给函数的方式抛出及捕获
异常调用时，try语句快中将沿嵌套函数调用链直至找到可匹配的catch，同时在栈展开期间释放局部对象及析构函数

catch语句需要严格匹配
- 非const -> const
- 派生类 -> 基类类型
- 数组传换为数组类型的指针



