language/C++.html

<div id="outline-container-org91f668c" class="outline-3">
<h3 id="org91f668c"><span class="section-number-3">3.5</span> 模板和泛型编程</h3>
<div class="outline-text-3" id="text-3-5">
<p>
template &lt;class/typename T&gt;<br />
template &lt;class T&gt; inline fn(int i) 函数模板<br />
</p>

<p>
模板形参作用域，声明模板形参之后直到模板声明或定义的末尾处使用<br />
</p>

<p>
模板形参的名字只能在同一模板形参表使用一次<br />
</p>

<p>
模板可声明不定义，同一模板的声明和定义中，形参名字不必相同<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;

<span style="color: #F92672;">template</span>&lt;<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">U</span>&gt; <span style="color: #66D9EF;">U</span> <span style="color: #A6E22E; font-size: 130%;">calc</span>(<span style="color: #66D9EF;">U</span>&amp;, <span style="color: #66D9EF;">U</span>&amp;);
<span style="color: #F92672;">template</span> &lt;<span style="color: #F92672;">typename</span> <span style="color: #66D9EF;">T</span>&gt;
<span style="color: #F92672;">inline</span> <span style="color: #66D9EF;">T</span> <span style="color: #A6E22E; font-size: 130%;">calc</span> (<span style="color: #66D9EF;">T</span>&amp; <span style="color: #FD971F;">a</span>, <span style="color: #66D9EF;">T</span>&amp; <span style="color: #FD971F;">b</span>)
{
    <span style="color: #F92672;">return</span> a + b;
}

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])
{
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span> = 1;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">j</span> = 2;

    cout &lt;&lt; calc(i, j) &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<p>
如果在模板定义内部指定类型，需用typename显示指出<br />
</p>

<p>
泛型编程原则，对实参需要尽可以少<br />
</p>

<p>
多个类型形参的实参必须完全匹配，模板函数不会转换实参以匹配已有的实例化，相反，会产生新的实例，除非<br />
</p>
<ul class="org-ul">
<li>const可用非const对象的引用/指针调用<br /></li>
<li>数组和函数可转化为对应的指针<br /></li>
</ul>

<p>
函数模板定义在别的源文件中使用，可用export，而类定义不用，类成员函数需要<br />
</p>

<p>
模板设计者：保证所有不依赖于模板形参的名字在模板本身的作用域中定义<br />
模板用户  : 与用来实例化模板的类型相关的所有函数类型和操作符的声明可见<br />
</p>

<p>
类模板成员函数只有为程序所用才进行实例化<br />
g++会合并同一种类型的模板实例化（目标文件会生成重复的函数），模板实例的符号是弱符号<br />
</p>

<p>
类模板可以有静态成员，但因为其有不同类型的实例，所以不可通过类模板名直接引用静态成员<br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #F92672;">#include</span><span style="color: #E6DB74;">&lt;iostream&gt;</span>
<span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;
<span style="color: #F92672;">const</span> <span style="color: #66D9EF;">double</span> <span style="color: #FD971F;">PI</span>=3.14159;
<span style="color: #F92672;">template</span>&lt;<span style="color: #F92672;">typename</span> <span style="color: #66D9EF;">T</span>&gt;
<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">Circle</span>{
    <span style="color: #66D9EF;">T</span> <span style="color: #FD971F;">radius</span>;
<span style="color: #F92672;">public</span>:
    <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">total</span>;
    <span style="color: #A6E22E; font-size: 130%;">Circle</span>(<span style="color: #66D9EF;">T</span> <span style="color: #FD971F;">r</span>=0){
        radius=r;
        total++;
    }
    <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">SetRadius</span>(<span style="color: #66D9EF;">T</span> <span style="color: #FD971F;">r</span>){
        radius=r;
    }
    <span style="color: #66D9EF;">T</span> <span style="color: #A6E22E; font-size: 130%;">GetRadius</span>()<span style="color: #F92672;">const</span>{
        <span style="color: #F92672;">return</span> radius;
    }
    <span style="color: #66D9EF;">double</span> <span style="color: #A6E22E; font-size: 130%;">GetArea</span>()<span style="color: #F92672;">const</span>{
        <span style="color: #F92672;">return</span> PI*radius*radius;
    }
    <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">ShowTotal</span>();
};

<span style="color: #F92672;">template</span>&lt;<span style="color: #F92672;">typename</span> <span style="color: #66D9EF;">T</span>&gt;
<span style="color: #66D9EF;">int</span> <span style="color: #AE81FF;">Circle</span>&lt;<span style="color: #66D9EF;">T</span>&gt;::<span style="color: #FD971F;">total</span>=0;

<span style="color: #F92672;">template</span>&lt;<span style="color: #F92672;">typename</span> <span style="color: #66D9EF;">T</span>&gt;
<span style="color: #66D9EF;">int</span> <span style="color: #AE81FF;">Circle</span>&lt;<span style="color: #66D9EF;">T</span>&gt;::<span style="color: #A6E22E; font-size: 130%;">ShowTotal</span>(){
    <span style="color: #F92672;">return</span> total;
}

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span>(){
    <span style="color: #66D9EF;">Circle</span>&lt;<span style="color: #66D9EF;">int</span>&gt;<span style="color: #FD971F;">A</span>,<span style="color: #FD971F;">B</span>;
    A.SetRadius(10);
    cout&lt;&lt;A.GetArea()&lt;&lt;endl;
    B.SetRadius(100);
    cout&lt;&lt;B.GetArea()&lt;&lt;endl;
    cout&lt;&lt;<span style="color: #AE81FF;">Circle</span>&lt;<span style="color: #66D9EF;">int</span>&gt;::ShowTotal()&lt;&lt;endl;
    cout &lt;&lt; <span style="color: #AE81FF;">Circle</span>&lt;<span style="color: #66D9EF;">int</span>&gt;::total &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    <span style="color: #F92672;">return</span> 0;
}
</pre>
</div>

<p>
函数模式也可以重载，规则如普通重载，但是也存在二义性<br />
</p>

<p>
<b>当模板与普通函数同时匹配且优先级相等时，普通函数优先</b><br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgd6b2d37" class="outline-2">
<h2 id="orgd6b2d37"><span class="section-number-2">4</span> 高级主题</h2>
<div class="outline-text-2" id="text-4">
<p>
异常处理为与对象类型匹配并且离抛出异常位置最近<br />
执行throw时，不会执行跟在throw后面的语句，而是将其转移至匹配的catch，throw将创建对象，同时传递给对应的catch，最后处理完异常后撤销<br />
<b>异常对象通过复制被抛出表达式的结果创建，所以该结果必须为可复制类型</b><br />
被抛出对象的静态编译类型决定异常对象的类型<br />
抛出指针通常是个坏主意，因为很可能指针指向的为局部变量，从而引起严重错误<br />
析构函数应从不抛出异常，以免再次触发异常使得强制程序退出，但构造函数可经常抛出异常，但要保证适时撤销<br />
异常以类似于将实参传递给函数的方式抛出及捕获<br />
异常调用时，try语句快中将沿嵌套函数调用链直至找到可匹配的catch，同时在栈展开期间释放局部对象及析构函数<br />
</p>

<p>
catch语句需要严格匹配<br />
</p>
<ul class="org-ul">
<li>非const -&gt; const<br /></li>
<li>派生类 -&gt; 基类类型<br /></li>
<li>数组传换为数组类型的指针<br /></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xuali2</p>
<p class="date">Created: 2020-10-29 Thu 19:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
